DAM/DAW Distancia. Sistemas Informáticos. Tarea 4 Paco Cuadrado / Elías Portilla

Actividad 1. windows server Gestión de usuarios con Powershell
PowerShell es una herramienta poderosa y versátil que te permite administrar los recursos de las maquinas
Windows de forma eficiente y automatizada. Con PowerShell puedes crear, modificar, eliminar y asignar
permisos a los usuarios y grupos de tu equipo, así como gestionar sus perfiles, preferencias y configuraciones.
Además, PowerShell te ofrece la posibilidad de ejecutar scripts y comandos desde la consola o desde archivos .ps1 o .psm1.
Para realizar esta actividad necesitas una máquina virtual con sistema operativo Windows (puedes usar un clon
de la MV WS2022 de la primera tarea). Cambia el nombre de la máquina virtual para que quedes identificado.
Crea un usuario cuyo nick sea la inicial de tu nombre más tu primer apellido1. Agrégalo al grupo
administradores desde la consola lusrmgr.msc. Inicia sesión con él.
    windows + R
    lusrmgr.msc
    creacion de nuevo usuario Agusto Linares
    Grupos > Administradores > Agregar al grupo > Agregar > AgustoLinares > Agregar
Ejecuta los comandos PowerShell que determines para realizar los siguientes trabajos:
1. Mostrar todos los usuarios locales de la máquina.
    Get-LocalUser   > podemos ver todos los usuarios locales de la nuestra máquina

2. Mostrar los grupos locales de la máquina.
    Get-LocalGroup > nos muestra los grupos locales de la máquina

3. Mostrar los grupos locales de la máquina cuyo nombre comience por "Operadores".
    Get-LocalGroup | Where-Object {$_.Name -like 'Operadores*'}

4. Mostrar los usuarios cuya descripción comience por “Cuenta”.
    Get-LocalGroup | Where-Object {$_.Description -like 'Cuenta*'}

5. Ver el usuario actual que ha iniciado sesión
    $env:username
    whoami

6. Iniciar el bloc de notas como “Administrador”.
    Start-Process -FilePath "Notepad"
    Start-Process -FilePath "Notepad" -Verb runAs

7. Crear el usuario "cnorris" sin contraseña y con nombre "Chuck Norris".
    New-LocalUser -Name "cnorris" -FullName "Chuck Norris" -NoPassword

8. Crear el usuario “blee” de tal forma que la contraseña me la pida por pantalla, el nombre sea “Bruce Lee” y
la descripción de la cuenta sea el literal “Desde Hong Kong”.
    $Password = read-host -prompt "contraseña" -assecurestring
    New-LocalUser -Name “blee” -FullName “Bruce Lee” -Description “Desde Hong Kong” -Password $Password

9. Crear el grupo local "grKaratekas".
    New-LocalGroup -Name "grKaratekas"

10. Añadir a “Bruce” y a “Chuck” al grupo recién creado.
    Add-LocalGroupMember - Group "grKaratekas" -Member ("blee", "cnorris")

11. Ver los usuarios que tiene el grupo “grKaratekas”.
    Get-LocalGroupMember -Group "grKaratekas"

12. Eliminar al usuario “Bruce Lee”.
    Remove-LocalUser -Name "blee"

13. Agregar un usuario, sin contraseña y cuyo nombre (debe ser tu apellido1) nos lo pida por pantalla.
    $Name = Read-Host -Prompt 'Introduce tu apellido1' 
    New-LocalUser  -Name  $Name  -NoPassword

14. Muestra por pantalla la versión de PowerShell con la que has ejecutado los anteriores comandos. ¿Es la última versión de PowerShell?
    $PSVersionTable.PSVersion
    get-host

15. Sal de la consola Powershell y muestra la consola lursmgr.msc y demuestra gráficamente como han quedado los usuarios y grupos.
    exit
    windows + R
    lusrmgr.msc
    muesto grupo y usuarios

Aporta CAPTURAS de la consola donde se observen todos los COMANDOS empleados.
EXPLICA y describe el formato de los comandos empleados.




Actividad 2. Directivas de grupo local
En esta actividad trabajaremos con las consolas gpedit.msc (Editor de directivas de grupo local) y secpol.msc.
Desde el Editor de Directivas de grupo local realiza los cambios pertinentes para que:
1. Se muestre a todos los usuarios el mismo fondo de pantalla (una imagen de tu grupo musical favorito).
2. Las contraseñas de los usuarios:
a. No caduquen
b. Tengan una longitud mínima de 6 caracteres.
3. Al iniciar sesión se abra la calculadora de Windows de forma automática mediante la ejecución de un
script.




Actividad 3. Programador de tareas
Estamos en una empresa donde el horario de trabajo finaliza a las 20:00. Quizás quede algún rezagado
puntualmente, pero en ningún caso ningún trabajador está operando más allá de las 22:00. Por seguridad y
eficiencia energética TODOS los EQUIPOS de trabajo de oficina deben estar apagados a partir de las 22:00.
Crea una tarea (Programador de tareas) para que el equipo se APAGUE a las 22:00 HORAS tanto si esta iniciada
sesión como si no. Una vez creada y probada, exporta la tarea e importarla en otro equipo Windows.




Actividad 4. Permisos NTFS
Partimos de una máquina Windows Server 64 bits, aunque el procedimiento es idéntico en una máquina
Windows 10/11. Añade un segundo disco de 5GB. y formateo como NTFS, letra F: y etiqueta tu apellido.
Crea el grupo empresa. Crea un usuario cuyo nick sea la inicial de tu nombre más tu primer apellido y crea
además los usuarios ventas1 y ventas2. Agrega los tres usuarios al grupo anterior.
Crea la carpeta “F:\compartir\ventas” y cambia los permisos para que:
▪ El usuario jefe tendrá acceso total sobre ella.
▪ El grupo ventas solo acceso de lectura.
▪ Cualquier otro usuario del equipo (salvo administradores) no tienen acceso.
Crea la carpeta “F:\compartir\jefe” y cambia los permisos para que:
▪ El usuario jefe tendrá acceso total sobre ella.
▪ El grupo ventas NO TIENE ACCESO.
▪ Cualquier otro usuario del equipo (salvo administradores) no tienen acceso.
